{
  "alpha_pattern": {},
  "auto_mapping": null,
  "base_model_name_or_path": "bigcode/starcoder2-7b",
  "bias": "none",
  "fan_in_fan_out": false,
  "inference_mode": true,
  "init_lora_weights": true,
  "layers_pattern": null,
  "layers_to_transform": null,
  "lora_alpha": 64,
  "lora_dropout": 0.075,
  "modules_to_save": null,
  "peft_type": "LORA",
  "r": 16,
  "rank_pattern": {},
  "revision": null,
  "target_modules": [
    "down_proj",
    "o_proj",
    "gate_up_proj",
    "qkv_proj"
  ],
  "task_type": "CAUSAL_LM"
}